{"pages":[{"text":"eric@ehamon.fr eric.hamon@protonmail.com eric.hamon@tutanota.de My PGP/GPG fingerprint is : 4E67 4CFE 0208 BFD9 5F7C 305F 131D BE59 D2CC 909A You can download it here: pubkey.eric.at.ehamon.fr.gpg.asc .","tags":"pages","loc":"https://ehamon.github.io/pages/contact/","title":"Contact"},{"text":"curl wttr.in/Gretz-Armainvilliers","tags":"software","loc":"https://ehamon.github.io/posts/20160828/la-meteo-en-ligne-de-commande/","title":"La météo en ligne de commande..."},{"text":"Evernote, le bloc-note dans le cloud Evernote est un logiciel de prise de note que j'utilise quotidiennement. Je n'ai pas encore trouvé de meilleur outil. Je m'étonne même qu'Evernote n'ai pas été déjà racheté par un prédateur de sociétés high-tech sur Internet (Facebook, Google, Microsoft,...). Vers la mi-2012, date à laquelle Google mis fin à son produit Google Notebook , échaudé , j'ai été contraint de porter mes notes vers une application alternative . Evernote a retenu mon attention. Prometteur et stable, Evernote ne me déçoit pas. Bien au contraire, il s'est bonifié avec le temps. La référence en la matière, selon moi. Mes critères pour ce type d'outils: Interface web (80% de mes accès) Existence d'un client lourd pour smartphone (android) qui doit prendre en compte les spécificités multimédia de la plateforme: appareil photo, sons, esquisses à la main levée , uploader des photos et pièces jointes,... Possibilité d'import de notes de produit concurrents. (critère moins pertinent maintenant) Pérennité dans le temps. (être à l'abri des prédation/achat des sociétés qui disparaissent avec leur produit dans la sphère internet) Possibilité d'export des données (je veux garder la maitrise de mes données) Avoir un client lourd sur chaque plateforme que j'utilise habituellement: Windows et Linux Possibilité de consultation/mise à jour des notes en mode offline (sans accès internet) Pas ou peu de limite dans le volume transféré dans le système (la version de base gratuite Evernote me suffisait pleinement) Evernote répond à ces critères sauf pour le client lourd qui manque à l'appel dans un écosystème linux . La situation n'est pas catastrophique. Une solution existe. NB: Je precise que je me suis abonné à Evernote, pour les soutenir évidemment et aussi pour utiliser pontuellement l'accès sur mes tablettes android. Nixnote Un groupe de développeurs s'est entiché de construire un système client lourd (multi-plateforme) pour Evernote. Le produit s'appelle Nixnote . Je l'utilise principalement pour faire un backup régulier, en local, de mes fiches Evernote. En cas d'indisponibilité du site Evernote et/ou de la connexion internet de la maison, je peux ainsi travailler sur mes fiches et resynchroniser par la suite, mes différents environnements. Nixnote fonctionnait bien jusqu'à peu sur mon poste de travail Debian. Un matin, j'ai constaté que la synchronisation ne fonctionnait plus, signe que les API Evernote ont évoluées. Il était temps de mettre à jour Nixnote sur mon poste. incompatibilité de la nouvelle version Nixnote Je désinstalle la version installée sudo apt-get remove nixnote Puis télécharge la dernière version en date de nixnote nixnote2-2.0-beta3_amd64.deb et l'installe par: sudo dpkg -i nixnote2-2.0-beta3_amd64.deb Et paff. çà coince. Le paquet ne s'installe pas car une dépendance d'une librairie est non satisfaite. Explication: Nixnote a besoin d'une version de la librairie libpoppler inférieure ou égale à 44 . Or sur la toute récente Debian 8 , on dispose d'une version plus récente: libpoppler46 (recherche par: sudo apt-cache search libpoppler4 ) L'astuce consiste à modifier le paquet à problème pour lever la dépendance . C'est un problème assez récurrent quand le paquet n'est pas dans un dépot officiel debian . J'ai suivi le HOWTO du forum ubuntuforums.org Copier le fichier videbcontrol dans le répertoire /usr/local/bin . videbcontrol nixnote2-2.0-beta3_amd64.deb On se retrouve sous l'éditeur texte vim avec le contenu suivant: Package : nixnote2 Version : 2.0 - beta3 Section : x11 Priority : optional Architecture : amd64 Installed - Size : 133120 Depends : libc6 , libhunspell - 1.3 - 0 , libpoppler - qt4 - 4 , > libqtwebkit4 , libqt4 - sql , libqt4 - sql - sqlite , libqt4 - xml , libqtgui4 , libqt4 - network , libqtcore4 , libpng12 - 0 , libpoppler28 | libpoppler43 | libpoppler44 , libsqlite3 - 0 , libtbb2 , libopenexr6 , tidy , libavcodec53 | libavcodec54 | libavcodec - extra - 53 | libavcodec - extra - 54 , libavformat53 | libavformat54 | > libavformat - extra - 53 | libavformat - extra - 54 , libswscale2 | libswscale - extra - 2 , libdc1394 - 22 , libopencv - core2 . 4 , libopencv - highgui2 . 4 Recommends : mimetex , libreoffice - common , openjdk - 7 - jre | openjdk - 7 - jdk | sun - java7 - jdk | sun - java7 - jre | java7 - sdk | java7 - runtime | default - jre Maintainer : Randy Baumgarte < randy @ fbn . cx > Description : Open Source Evernote client . NixNote is a client for the Evernote service ( www . evernote . com ). It will allow synchronization and editing of notes from your local system . Ajouter libpoppler46 dans la ligne Depends Sauver le fichier et quitter l'éditeur. (:wq) Le fichier nixnote2-2.0-beta3_amd64.modified.deb est généré. On installe finalement le nouveau paquet. sudo apt-get remove nixnote2 sudo dpkg -i nixnote2-2.0-beta3_amd64.modified.deb Voilà, voilà. It runs as expect!","tags":"computer","loc":"https://ehamon.github.io/posts/20150610/nixnote2-sous-debian8-jessie/","title":"Nixnote2 sous Debian8 Jessie"},{"text":"Introduction L'apprentissage du débutant Piller à donf et ne jamais se faire plumer Avant 2015, l'ère des BOTS sous COC Une solution simplissime Une solution un peu plus complexe. Quoique Actiona3 ou les tests d'interface GUI au secours de COC Autres axes de recherche pour COC Conclusion Introduction En France, il est difficile d'échapper aux multiples diffusions de spots publicitaires sur le jeu en ligne Clash of clans de la société Supercell . ( spot officiel ) A noël dernier, je me suis lancé dans l'aventure pour découvrir ce jeu en ligne. Mal m'en a pris, six mois plus tard, j'y joue encore. Ce jeu est vraiment addictif. Je ne vais pas donner de conseils de jeu dans ce billet. Internet fourmille de tutoriaux, de forums, d'astuces divers et variées qui permettent d'améliorer son style de jeu. Je vais par contre vous narrer une période révolue de mon expérience de jeu qui a duré quelques semaines sur COC. L'apprentissage du débutant La prise en main du jeu est très facile. Dans COC, les règles sont encore plus simples que l'excellent jeu Warcraft2 'Tides of Darkness' sorti en 1995. ( cinématique ). Point d'I.A (intelligence artificielle) ici, on joue principalement contre d'autres joueurs humains . On peut également jouer un peu en mode solo sur quelques cartes pour se faire de l'oseille sur le dos des Gobelins. Mais c'est anecdotique (et pas facile). Tantôt, on lance un rush de trois minutes pour collecter un maximum de ressources de son adversaire. De l'autre, notre village fortifié est régulièrement visité et souvent pillé . Une stratégie de développement doit donc être soigneusement élaborée pour optimiser ses ressources et augmenter très rapidement le niveau de son HDV ( hotel de ville ) pour espérer obtenir de meilleurs et/ou de nouveaux batiments et de meilleurs niveaux pour les troupes d'attaque. On doit également sauvegarder au mieux les ressources collectées précédemment: butin des pillages et home-farming . Bref, un gameplay des plus classiques où le joueur est souvent ralenti dans ses objectifs car il est régulièrement contrarié par les actions belliqueuses d'adversaires plus ou moins ingénieux pour vous ralentir au maximum. les ressources sont les nerfs de la guerre et du développement de votre village . Mon objectif était de rattraper le niveau de jeu ( level ) de mes enfants. qui avaient succombés bien avant moi à ce jeu. J'avais plusieurs mois de retard à l'allumage. Un petit challenge à relever, en somme. Piller à donf et ne jamais se faire plumer Au début du jeu on ne dispose que de deux ouvriers . La construction et l'amélioration des batiments deviennent de plus en plus longues et les coûts s'envolent de manière exponentielle. Il n'est pas rare de cumuler beaucoup de ressources et d'attendre très longtemps la disponibilité d'un ouvrier pour une construction. Malheureusement, lors de cette période d'attente, on est victime d'attaques qui peuvent vider vos caisses à trésor (or et elixirs). SUPERCELL a prévu le coup pour vous épargner ces temps forcément angoissants pour la prospérité de votre village. Le joueur peut dégainer l'ultime arme absolue:... sa carte bancaire pour acheter des GEMS (1 cent d'euro par GEM!)et accélerer/finir ses actions de construction dans le jeu. Il peut aussi engager un serviteur servile et dévoué à votre cause: un robot. Argh! On va me traiter de mauvais joueur ou tricheur. Que nenni. J'ai un challenge à emporter. C'est tout. Avant 2015, l'ère des BOTS sous COC Définition: BOT . L'année dernière, il suffisait de jouer en permanence au jeu COC pour éviter d'être attaqué. Jouer 24h/24 était donc LA solution pour éviter les pillages. Une personne normalement constituée peut très difficilement jouer sur une aussi longue période. Par contre, la tache est tout à fait envisageable pour un robot. C'est sa fonction ultime même. Un vrai terminator en somme. Googlez et vous serez surpris des tentatives de batir des BOTS pour COC. Le principe est simple. Le robot doit générer des clics sur des objets graphiques (des batiments) dans l'interface du jeu, à intervalle régulier, et ce, sur une très longue période. Suffisamment longtemps pour que le joueur n'intervienne uniquement que quand un ouvrier devient disponible. Le joueur ordonne à l'ouvrier une tache à accomplir sur un batiment, puis s'éclipse à d'autres activités plus domestiques (la vaisselle?). Bref, l'utilité d'un robot n'est pas à démontrer. Pour éviter ou minimiser qu'un robot/BOT joue à la place de son jeune client (eh joueur), SUPERCELL a donc introduit une période de déconnexion obligatoire d'une vingtaine de minutes toutes les six heures, pour prévenir une possible addiction au jeu et surtout (IMHO) dérégler d'éventuels BOT. Tentatives vaines selon moi. Une solution simplissime Ingrédients: une tablette/smartphone Android 'rooté' qui sera allumé 24h/24 sur COC. une alimentation secteur pour votre appareil qui devra fonctionner une dizaine d'heures avant de planter ou vider la batterie de l'appareil. application RepetiTouch Free à télécharger sur Google Play. Recette: enregistrer une macro avec des clics sur quelques batiments (ne pas oublier un clic dans la zone où apparait le message de déconnexion périodiques des 6 heures) lancer la macro dans une boucle infinie. Et voilà! Simple, efficace. Pas de rush à craindre tant que le système android de la tablette est stable et qu'il n'y a pas de coupure réseau wifi, ni de fermeture par SUPERCELL de la plateforme COC pour maintenance. Une solution un peu plus complexe. Quoique Sur une tablette/phablette/smartphone, COC sollicite la carte graphique de manière intensive. Sur de longues périodes d'une dizaine d'heures, la batterie de ma tablette android Nexus7 2012 tend à se vider complètement, le BOT maintenant artificiellement l'écran activé . L'autonomie est donc très réduite malgré la connexion permanente du chargeur. Parfois, l'application RepetiTouch plante aussi. Loi de Murphy ou darwinienne, l'issue est inévitable. Fatalement, le village va être sauvagement attaqué en votre absence. Donc, il a fallu trouver une alternative plus fiable pour pourvoir maintenir un BOT sur une plus longue période. Actiona3 ou les tests d'interface GUI au secours de COC Anciennement 'Actionaz', Actiona est un logiciel intéressant à plus d'un titre. Je reprend l'index du site Actiona . Actiona est un logiciel d'automatisation de tâches. Il vous permet de simuler des clics, des pressions de touches, lire le contenu d'un fichier, jouer un son, télécharger un fichier ou une page Web, etc. Le logiciel possède en tout 40 actions différentes et fonctionne aussi bien sur Windows que sur GNU/Linux. Il vous permet même de développer vos propres comportements en utilisant du Javascript. C'est un logiciel libre. Il est disponible sur les systèmes Windows et Linux. Et là, çà tombe bien. C'est compatible avec mon ordinateur personnel qui tourne sur une distribution linux DEBIAN. Un autre avantage du logiciel et pas des moindre, on retrouve le langage Javascript si on veut pallier à certains manques du logiciel. C'est le cas ici où j'ai dû composer avec du code Javascript pour la gestion du temps chronomètrage d'actions. Ingrédients: un PC sous Linux. Windows devrait également faire l'affaire. l'émulateur Android Genymotion le logiciel Actiona Recette: Installer et paramétrer une 'machine virtuelle Android avec Genymotion . S'inspirer de l'excellent billet de La bande des frappadingues http://www.bandofnuts.fr/linux/virtual-android . Merci à eux. Récupérer mon fichier script clash-of-clans-bot-02.ascr Sous Actiona charger le fichier script et l'adapter. Démarrer le script Conseils: Maximiser la taille de la fenêtre du système Android virtualisé 'Genymotion'. Déplacer la carte COC selon un repère que vous choisirez (bordure d'une icone ou du décor). actiona s'appuie sur les coordonnées relatives de la souris X,Y dans la fenêtre de l'émulateur Android. La position X,Y d'un objet doit être précise sinon le script cliquera 'dans le vide' ou sur un mauvais élément graphique. Corollaire: il faut redéfinir, dans le script, les positions X,Y des extracteurs de ressources (or et elixirs) à chaque modification de la carte (map). Sic. Le robot automatise/sérialise les clics dans le système fenêtrée de l'interface. Il ne se préoccupe pas réellement de l'applicatif survolé. La fenêtre de l'émulateur doit être toujours en avant-plan . Ne comptez pas utiliser votre ordinateur pour faire autre-chose (qui fatalement changera de fenêtre active). Le PC doit être dédié au robot et à COC, à temps plein. La compréhension du code ne devrait pas présenter de difficultés. Autres axes de recherche pour COC Dans le monde, des personnes/joueurs ont mis au point de multiples système robotisés encore plus complexes pour COC. Ainsi, un robot peut être à même de chercher une carte à attaquer selon certains critères. Généralement un seuil minimum d'or et/ou d'elixirs. L'astuce consiste à faire une copie de l'écran (screenshot) et d'analyser l'image sauvegardée. Ca existe. Des sources sont disponibles sur la toile. Utiliser le debuggeur ADB d'Android python/adb Automated Clash of Clans Gold Farming ADB, Raspberry Pi & Python Utiliser un 'analyseur de protocoles'. Quelqu'un me souffle à l'oreille wireshark? . Il s'avère que la société SUPERCELL chiffrerait les échanges de données client/serveur. Par rétro-conception, on pourrait décoder les échanges (format xml) et éviter de faire de l'analyse d'images. Le top. Et pourquoi pas modifier certaines données dans les flux. Par hasard, le nombre de ressources: or et elixirs. Hum. Mode triche activé! Des threads existent dans certains forums. Je vous laisse les chercher. Utiliser un BOT commercial ou communautaire(?) clashBot.org par exemple. Non testé. Méfiance quand même, le fishing existe bien dans le monde des jeux multijoueurs . Des individus/organisations peu scrupuleux cherchent à obtenir vos identifiant/mot-de-passe et votre carte bancaire. Méfiez-vous! Fuyez même! Ne succombez pas à la tentation! Conclusion Début 2015, SUPERCELL, la société éditrice du jeu COC, soucieux de préserver l'intérêt de sa poule aux oeufs d'or : 1,55 milliards d'euros de CA en 2014, modifia la façon de jouer à COC. Ainsi, il est maintenant possible d'être attaqué alors que le joueur/bot est connecté ou en train de jouer. Ce mode live introduit une petite révolution dans les BOTS qui perdent beaucoup d'intérêt. Malgré çà, avant cette introduction de l'attaque en temps réel par SUPERCELL, j'ai cessé d'employer le BOT. Les tactiques employées par vos adversaires lors d'attaques de votre carte vous font progresser beaucoup plus vite dans la compréhension du jeu, et montrent, au grand jour, les faiblesses de vos défenses. On peut alors modifier subtilement la disposition des batiments pour se prémunir de revoir la même attaque se reproduire. Rien de nouveau dans le cycle: action/réaction des simulations guerrières. A lire également, pour parfaire votre connaissance: L'Art de la guerre - Sun Tzu De la guerre - Clausewitz Bon, je m'égare un peu du sujet. Jouez bien.","tags":"software","loc":"https://ehamon.github.io/posts/20150605/clash-of-clans-by-a-novice-bot/","title":"Clash of Clans played by a novice bot"},{"text":"Cout approximatif (les éléments sont disponibles sur Amazon) Ecran: 70 euros Raspberry2: 44 euros Boitier: Pibow Rainbow pour Raspberry Pi (2 & B+) 18 euros carte PiBow VESA Mounting Layer Plate ID: 1320 . 10 euros (hors amazon) carte microSD Samsung de 32 Go 17 euros Cable hdmi: 5 euros Chargeur EZOPower 3.1A 15W Chargeur USB secteur avec 2 ports - Noir, Chargeur prise mural d'europe UE 8 euros Dongle WIFI: Edimax EW-7811UN Nano Adaptateur clé USB sans fil 150 Mbps 13 euros Clavier *Logitech Wireless Combo MK520 * 46 euros Total: 231 euros environ Système Ubuntu MATE pour Raspberry. logiciels Firefox LibreOffice ... Et du temps évidemment.","tags":"computer","loc":"https://ehamon.github.io/posts/20150602/montage-d-un-raspberry-2-sur-un-moniteur/","title":"Montage d'un Raspberry 2 sur un moniteur"},{"text":"Introduction Users of SAP-B1 (v8.82) complained when our IT team switched the SAP server to a datacenter. Migrated to a datacenter, and despite huge improvements ( increased number of processors, better frequency, memory, higher IO disks), SAP-B1 began to dissatisfy users. Before, SAP-b1 server had a unique LAN-network card. The server didn't met any/specific trouble. Fast, responsive, accurate, the server did the job. When users tried to login to SAP Business One, they found a long delay during start-up. All of them were affected. 3 minutes to get the login form, and 3 more minutes to get the main SAP-B1 window. (add a couple of minutes to start addons) First, we thought that some kind of network slow down the process of SAP-B1 to locate the licensing server. Despite searchs and googling, none of tips or recips pull through. Most of discuss try to resolve the same issues on the server side. 'disconnect/disable network cards and enable them after reboot, and so on... In our situation, we haven't full admin access to the server. We are not allowed to reboot at will the production server, and we are forbidden to play with hardware tests. Then I think that if everybody suffer the same pity behavior on SAP-B1 installations then nobody try to find a solution on the other side, on the computer of the final user. (Windows7 mainly) I search and find a clean turn-around on slow starts of B1. It seems stupid but it rules wery well to our issues. Hope that yours too. Some steps to solve slow starts of B1 On the server side, enumerate and write down on a paper the list of network IP address. all of them . On the client side, open a command with administratives right. ping each IP address of your list. Note those which fail! adapt this next command to your configuration, where the field 'remoteip' contains IP which previously failed. netsh advfirewall firewall add rule name=\"SAP Connexion\" dir=out remoteip=10.xx.xxx.xx,10.yyy.yy.yy action=block close the 'command windows' by exit . The state of the last command is permanent. start your chronograph when double-click your SAP-b1, you will be surprised by the elapsed time! Explanations. In this case, the server has three network cards. 10.xx.xxx.xx ==> network for backup 10.yy.yyy.yy ==> network for administravive tasks 10.zz.zzz.zz ==> users network Third IP is valid ('pingable') outside the datacenter. 'ping' on the others fails! This a scenario when SAP client software start, on a computer outside the datacenter. start of the software client method call to the server 'give me the list of your network cards!\" for each card in list do stuff with this card (time allowed 3 minutes max) exit loop and go further if return_code is OK endfor Two of the three calls never respond. Timeout exception raise at each time. Then, the final user has to wait for a long time. You are lucky is the 'user network' is the first of the list. The process start quickly in this case. Anyway, you have no control to alter the list. That's why, sometimes, the start of B1 seem very fast and sometimes, very slowly. (After a monthly reboot of the server in our company. It's a random jackpot) Now, with a firewall rule which block IPs, the response is always immediate. OK or KO. Users lose few milliseconds, but not precious minutes. SAP B1 start in less than 20 seconds. Users are happy. The boss too. Time is money. ;-)","tags":"software","loc":"https://ehamon.github.io/posts/20150528/sap-b1-slow-to-start/","title":"SAP B1 slow to start"},{"text":"Preface # This post was written in 2008. It is still available on my first personal dokuwiki 1 . I convert the old wiki in Markdown format, for the future. Google signals me by email that my very old Dokuwiki don't follow responsive design. The french web-provider FREE do not authorize wikis any more on their sites. Then i close logins and i won't migrate the wiki. Maybe the site will be vanished in some days (months, years). Regards Eric Introduction # Early adept of handheld from Palm Corporation , i am very happy with my last (and now old) handheld: a Palm Tx . But i look for a better integrated system with GPS, bluetooth2, large screen, like latest smartphones. Actual devices from Palm™ don't fill my criteria. Oups. Ready to switch to a concurrent? Not really, i use an application on a daily basis. Its name is Datashield from Ultrasoft . A great product! But it seems that this application is built only on PalmOS system. Thus, i searched an alternative for Datashield. Quickly, i found SplashID . Similar to Datashield, splashID works on multiple devices: PALM, Symbian, iPhone, windows CE/pocket/mobile, etc. I don't want to write again my three hundred of personal records on the new system. A first search shows that the Datashield desktop could export data in a file with XML format. Great! After that i seeked a converter to import my xml-file (from Datashield desktop) to SplashID desktop. I still search. Huh. At last, i decided to build a quick and dirty script to do the job. With hope, that could be usefull for anyone. Regards Eric HAMON Limitations Scripts are only parts of a one-way converter. Datashield to SplashID. no less, no more. I didn't respect 'design pattern'. Scripts work well but lack of readiness. Blame me and delete all files after the migration of your data. I am Perl addict for a long time. This project is my first use of the ruby language. Datashield and SplashID desktops are Windows programs. Thus the converter 'Datashield2SplashID' runs on Windows too. Ruby scripts are simple and don't use windows API. They run well on linux box (tested on ubuntu 8.04), but i have not test 'Datashield and SplashId desktops' on Linux-box. Maybe on wine . Steps Install sqlite3 library Go to SQLite downloads page and grab the sqlitedll-3-xx.zip archive. Extract it to C: . Install your Ruby environnement What? You haven't tried yet ruby? It's a kidding joke. download Ruby RubyInstaller . see details on ruby-lang Update your ruby environment (windows only) Download RubyGem and install it. ( RubyGem howto ) gem uninstall hpricot gem update gem -v Add ruby libraries open a command terminal (alias 'cmd') gem install sqlite3-ruby --version = 1.2.2 gem install xml-simple Download 'Datashield Desktop' If you still not use the 'Datashield Desktop', it's time to download and install this application. UltraSoft website More instructions are available on the Ultrasoft or Palm web-pages. Datashield Desktop is a commercial product limited in time 30-day trial. A dozen of minutes is enough to our migration. Synchronization of datashield data First! You must synchronize your Palm data with your Desktop. Export your personal data from 'Datashield Desktop' Create a working directory for the migration open a command terminal (alias 'cmd') mkdir \\dataconvert cd \\dataconvert Export your personnal data from 'Datashield Desktop' Run 'Datashield desktop' Go to the menu 'File' click on 'Export...'. Save as 'Datashield.xml' in the directory created before. Uncheck 'Encrypt exported data' !!! That's all. Close the program. You don't need anymore 'Datashield desktop'. Download and run ruby scripts Download readIt.rb and writeIt.rb to C: . readIt.rb import the xml-exportfile from dataShield to a sqlite3 database. writeIt.rb create a file to import with SplashId desktop software from the sqlite3 database. Run the machina open a command terminal (alias 'cmd') ruby readit.rb A sqlite datafile named ' Datashield.db3 ' will be created. That's all. in the same terminal session, run ruby writeit.rb Two files are created. 1. splashId-listetypes.txt => fieldnames of categories. 2. splashId-ego.csv => a csv-file containing your precious data. Download software 'SplashID Desktop' See SplashData to download the software suited to your device. Install 'SplashID Desktop' on your PC. Final data import Run 'SplashId Desktop'. Go to the menu 'File', 'Import' and click on 'CSV...'. Select and confirm the file '-ego.csv' Create categories If you double-click a record, you notice that all of Fieldname are named 'Field1' to 'Field9'. 'SplashId Desktop' don't care of that. You have to rename manually, one by one, all fieldnames of types. read my post on splashdata forum . To do it, follow those steps. Edit or (better) print the file 'splashId-listetypes.txt'. (This file only contains fieldnames of type records really used in your data. Click on combo-box named 'Type' Select the last item 'Edit types' Edit each imported records type Sample Conclusion Your personnal data are now fully imported and be ready to give you satisfaction on your handheld. 'Datashield2SplashID' job is done. If you use my scripts, send-me an email. I am curious to know, how many people migrate from datashield to splashId. Contacts Author: Eric HAMON eric@ehamon.fr Support Well. Feel free to alter scripts. I don't use them anymore. You know why. 8-)","tags":"ruby","loc":"https://ehamon.github.io/posts/20150518/datashield-to-splashid-converter/","title":"\"Datashield to SplashID converter\""},{"text":"pub 2048R/D2CC909A 2013-05-11 [expire : 2019-01-01] Empreinte de la clef = 4E67 4CFE 0208 BFD9 5F7C 305F 131D BE59 D2CC 909A uid Eric HAMON <eric@ehamon.fr> uid [jpeg image of size 5059] sub 2048R/7D470A15 2013-05-11 [expire : 2019-01-01] pubkey.eric.at.ehamon.fr.gpg.asc -----BEGIN PGP PUBLIC KEY BLOCK----- mQENBFGOHqEBCADU+MEyDdg+toUale8JWVDWZx3N+mHrd8kh5YRaiPVUyOvLJB7r sq2Xemqcl3Kx6cvXbjkD2ztL+1qDp5k92UXkfVJ+sQAfdpEWuVUavca0o2QZVH/Q dL2ODSOkLkzGOJ0YlTEzudt1ypTNwYau6INWQP8SFJ7X44ufv1MK2lHsUTuh6Rxc eoG6Zl7ijzAsLFKgKjTeV0muhOBmXiHcRV+TFIzREwOlCz5wAiJLBZDfGR1E2PRM um+ApwgQkRNQXMdG+pibCK3YPdE9YLyqoPo7DnHxDVemszDo++X/0sgVKKuZMyYy SvRvCGx2XBZKDKU9V6Kw3w4NjHBfpDZ0DeNdABEBAAG0G0VyaWMgSEFNT04gPGVy aWNAZWhhbW9uLmZyPokBVQQTAQIAPwIbAwYLCQgHAwIGFQgCCQoLBBYCAwECHgEC F4AWIQROZ0z+Agi/2V98MF8THb5Z0syQmgUCWF+rXQUJCp0pkQAKCRATHb5Z0syQ mvywCACk3CQagvYjwojoCofDUckof6OHqNozfdBiPKelH94K8yC8GecaI344qotO +vsdv8wy5NGgAyF2nz3jOmDiIHc9sReWq0P7R1J7MBZ4x6mbbUVusQy+ZjO77fQ0 EPNXpXKSxylWmH80YV1mqZds6tiva+mYKjbASzVEqck7VZhVZ7xH6jXbQ1uzAFKh ys7pgV2HFCwL2b9WrpSaXIZn8cG8vFrEy1N/In1GERIH7GEkrzYy23rdNeGhEChl Ih9CkhvTke8TCAQ4wiQYGv3CNoDjPuWWvKeWfcGkzyjWrk38SnooojNAyemIpgP3 uwNCYBnnBj68xcAuKDKnViTbGtZOiQE+BBMBAgAoBQJRjh6hAhsDBQkDwmcABgsJ CAcDAgYVCAIJCgsEFgIDAQIeAQIXgAAKCRATHb5Z0syQmsqvCACb8BdgvqeHEzu4 L2+rxSsneB+KwFZq+4pOkfKBJAjeWbu9T0uaSv5QFS1tAqdD/MwyjU894mKIujpD nZUvb/amP5O24jcgGNLHUOmAA0MXcQQply+YbythWc1Q9DywZKIktJOpnAtFHliy 5slrBudH0vTvj/jf4gPCk4FZ4fjQWxVZQkaPUKe1/1McrcxYejiYfvKZYXtsTaGN N1zVrtcHdX8v3oZc+eb+x2+DBWXe96o463WxiFUaXxmeV7CheXpObxMSJIywbmFf tIAKk1EvbzV3aKM/1yy2LxMW+Qz0fiPLUH8Gf/dLilI/cfZqtOGCnX++Qk6yD0DT TIKhABHT0dMW0xQBEAABAQAAAAAAAAAAAAAAAP/Y/+AAEEpGSUYAAQEBAEgASAAA //4AE0NyZWF0ZWQgd2l0aCBHSU1Q/9sAQwACAQECAQECAgICAgICAgMFAwMDAwMG BAQDBQcGBwcHBgcHCAkLCQgICggHBwoNCgoLDAwMDAcJDg8NDA4LDAwM/9sAQwEC AgIDAwMGAwMGDAgHCAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwM DAwMDAwMDAwMDAwMDAwM/8AAEQgAeABkAwEiAAIRAQMRAf/EAB4AAAEFAQEBAQEA AAAAAAAAAAcABQYICQQCAwEK/8QAPxAAAQMCBQIDBQUFBwUBAAAAAQIDBAURAAYH EiExQQgTYQkiUXGBFBUykaEjQlJisSSCwdHh8PEWFyZykrP/xAAbAQABBQEBAAAA AAAAAAAAAAAGAgMEBQcBAP/EAC4RAAEEAQIDBwQCAwAAAAAAAAEAAgMRBAUhEjFB BhMiUXGRsRRhofAywUJSgf/aAAwDAQACEQMRAD8Avc7Bsu3rjyKeLEhN+v8AXD0u BZwWHcY8qhgA8D/ZxZ8KpqUflx/KSCB1NsQDWvVqgaNZPkVnMdTiUmnR0kqdfXt3 GxO1I6qUbGyQCT2BwSa4pMOMtarBKRc/TGGPtCvFBmPxW6xzg6XI1AoUp2LToSVX CEJVtLiyLgrXbryB0BNrlsNs1yS44+I7K0mqXtt8o0WcpnLlBqVaaRcKefcTGSo+ g5IHXkj6Yq7qb7U3VfOjst2m1uJRIbiv2UWG03uaH/uoKWT3Jv1PbjAcy5pRUcxM KQxAdeTcghKCT3uRxiRQvCVmidHWiLTJbi+VFIbIKQe+EOlx2HxH3VpDps7hbWH2 UvyD7SXV3Lk1H/kzNTbCQgIlstu2B/eJsFE+pODjkb2wlahMpazDlynS1ICdz0aT 5G497pVex+RtipuYtHazkdlKKnSJTLiiAhbjXT09cRKTQJctTzSUPC5CgCb4UO5f u1cfiSMPC9u/otePDh44cp+ItppmLKYp9XKSpVPffT51h3T03j1GDvGV5qAR3Axg Ll6VUslZhjyo0iTCmwVB1p1pe0pUORyOhFuPhjV32fHjpj+IzLLdGrJ+y5lpraEu E/gmC34wbABXB936j06+Ph5GwoT4zzqlaXyNybAcfG2Pm9GsOvfHew0FtA9enOP1 UMuI4HPwx4BMAJs+xpXyQScLDkIBA4SbYWO0lUEe1QQV8AHkXxzyo2xJ4+OHr7LZ XIsL445bJCV3TYDgfE4eITe6on7XzxhOaB6SDL9CnsN5hzGpUZaULu/FjlJ8xwW5 Sr8KQevvEjpcZu+Grw+S9Sq81LmxFNQCU7nFqtsHUi3e4P6nBL9rfn1jUPx9VOAw kfZqII9NW4P3nUgLWfmFLKf7mDPopQm6flyA0w0hDaWkk8W3cC/H++uKDWsx2PEA zm5GXZLTWZMpe/kERdL9IaRQqYiPFp0ZLSU8EpBJwTqTlKOhwIbjNNKPVYSBcW/X DZkRKYrLaVAFRG4Hbz1wQaZJQjaolSARfgc4z58j3HclbSyGONoAaFFs3aT0av03 bJpsaQnjcFtpUMBnP/hGyZNeElqmGnvJG3+zK8sKHcEDj/HFlalJUtt7y0BSQBwU jjj/AFwNs3OkoUgpVuA7jvhyOaVn8XFNvxYZLL2AqmniM8KlAdoDzlPgtsSmW/cL YsCB2Ivz0xVDQ/VGV4cNc6XXFh9LESYhEtoAje2bBQI78cj4m2NINRIofYWlSSAU 9xjPrxmUyNTs2pQltLbqhuSu3B/lwZ9ns50jzjv3BWadsNLjjZ9RGKpbZ6d5gg5x ypAqlNkNSoFQYQ/HebVuQ6hSQUqB7gg4kAhXv7tgfTFLfYd6j5gz34fqjTao85Jp mXZSIkBa08oCklamwruBcGxvYKHY2F6mYx29ME/AQaWa35JpVDIA6dMLDsYwPYj6 4WPcK6HFHRyCd4Fu+OWdCKmV8JFgbXxIFMgOj5/54bK4tKI69xCRbCyNk2DZX86v iecfzt7QzOiEgKdXmqYlRvfhEhSQbfDaB+WLl5EqFNojUVEuXFibtrTYdcsVkDsM Vf1GyYaV7RbUphKlSPIrM91DhBH43itP6K+vbjBPp1Sgee9WMwTVswI9kR2R+Jax 369zf88C2vM72RrfIfK0HsnKceIvA3J+Fa2m5volIhpcVUaemw7vhH15xN8rZzpV cjbY8iO6psfuKCufgDikCM15O1KzamgxMuVl6sqSV+QS62SBclW21x0Pa2Jtp4pv JVTpq4aKjAgTHlN7XFBadyeqbgn9bfLA9Pp5ibbgb+4R5h6y3JdwijvWxtW5n5ii wRzsQEj3gTa5tx/TA8zLnfL0x9xv7whJcuLpLouOv/GIdr1mBqPQ4/lvy/PlFKEp bVytR7YAWbNNF5Xp9XzAzltFWFHcSZW+atThKjyQlN+newPw6m2G8LF780pGp5/0 YLj058/6tFLUzNVFL6Y7U1BkLBDaRxuIGKM+N/LbtSLVSaaUTFUA9Y9Envg3V/Or Wc6FTzV8oPUZU5BXEfS6pQYINvjdJ/L62OIfqVliRUNNqimctTpLexDpVfenba/p wAPpi9wIvpMhruoKD9Vyfr8Yg8iNv0qyXsB8yMytDs30YAh6DWUSlE90usISn/8A JWNCWmbpF+uMx/Ye6kZf08y5WKbIU8armSsswmw2gFLaUMjYVkkH3lLUBYG3ew5x qJEY3M3A69MGAe1znBp5FZk+F7GtLhVix9xyXJ9jB6jCw4ojXT0BwsKTVI7LjhXz /wCcDbxLURyuaHZwiMOKZefpEpCHE9Uq8pViMFXyQpPcH/nEZz9T0yMuVFtTfmJV HcBQRwsFJFjjkgtpC5A7hka7yI+QsFNP9L15N8S8syf2hqUZMxRUkgJK1cgelxf0 6dr4s0xoJFqTLc9MVDzSLXSQOo7/AAxEPE9TIeV9VcsuQ3EFSWTHUQOyVJPJ78qO DRkjNqTQWWlKsnZdXrjPdQnkdwyN8vhbFpeDGyZ8Tuhv33X7k/S5iC85UUMiNKWj y1ynEIS4U/w7gNxH9cQjVuqNszI7DLTKGYjwKdrYSXVni5t1ODEJX3rDICkttpHN hYC2Kzavai0uhZ+JqDq0RGpIYCtp2JAtyo9E3Pc/AYhQvkmPi3pET4IoI7bQ/ClO tchyPHo8pw7EI2+9e1j2P54luWJaM10pH2xw+Zt2brkJIHS9rHA78R2sWWZ2SqQz EU5LnqUlCWEICiojm4Cbki3X4YfvDrmBnMeT1MrUpt6G4ptr+dIsbH5Xt9MK7tzI w4bJ1745ZyAb26L6Zw0aRWJbbZjR22EdFglRI+AJwHPErS4+W8iy2dqPMQkoBHF+ MWHzPmJcCEGyshPTnt/lisnjGq4fyvdKgd7ovh/B45JW8R6ql1hkcUTi3mpH7MnS JulZ0yLWzA2h15ZWo2upZacs4fQEWHzPxxqnToYLA4NzzjOTwHZ2QxR8g01Mf+1z ZUdkFKTyEOjcR/cTc/P6Y0sp7ITGHfBrprnODy7/AGWadoImRuiDD/gP+LjVT7no r88LDt5HHS2FiyVBSMwYKVWtfof64bK3DEiM4hQulwEEYkgi3RwT0F+cNFZikoV8 D+mFAKIDusU/GPp/O0s1K+65zL6DR6ittlxwkqfYUq6F89QUpFjz09MSvJ9fKW4y bnaoA8d+MXY9pZpI1n/wxZmfbhsPVKisioR3VIBW0lpaVubT1F2wv54z60/rKJNA iuhQUUAfO9v9MBmt4ndVw8t1qHZvUjkEudzFAox13OqIFHRFbIDj3Kueie+AvqHl ZjONackN+cFSbJeShZDboAsNyeh7YkuodKnKozr9PU2X3m07S4o2R62HJ5wJ6Pl7 N1QlKMzMbcZKeLRUqaKfyNz+uKXFa1viB3RrNJJM7uDs3zXye0yD7TrjUZLDsZYs W0FCgB8SLHn0wSdM6w3lOjtx42xDrB3hAAF+efz9cQ2rZJqdYZKV5rrEgtEGzilI T8zccn1w0ZGyLmGLmVTv/UUhbKFfgcZSq4PqeTiZkOa9viPyokcDsV1xO4iUZ855 lZrNCExpR2qTc/ynuLfnitvibrAlZdiND3lvvAg37f7ODnX4v3FlB9PnIe3qJBHY lIvx88A+FlR3WfXPJ2V0oUtNUqTLLiUC5Q0VAuq/uoCj9MK0mIumAHmqzX5+GEud 5K53s7PCtXsvy8v1+vwXqbGo0JP2Zl+yXHX1tlKjs7IAUTc2ubWvzi88Ri7fPHpb DFlmmiNAaSAAlAAAA9MSmDH/AGQ4t6YOoYWxt4WrKsrJfO/jf6LyEuNgBK1D42Ns LHStASQNt+MLD1JhHQRN7QsARx8RhqqsQhLgI5Bth/bUFJta1rf44bKqwFbha5vz zhsFRK8kMNRaHGq9Cmw5baHYsplbLyFj3VoULKB9LE4xNyPWG4FRqlLaeRIRCfca bcB4cCVKsoehtjW/x96jq030ckR4q0N1LML6KZHBN7JcUEuLtcGwQSLjoVJxjXnS jydONTqghALjX2haEr2lIcSTdCwD2IsR8xip1hokjDeqK+zchZI53oitF1DXMYTG USCzYWI9bWw9Q2YT6W1fZ0Lfcta/rgCzM8u0OrtyVJ2sqPvjoPU4JeX9RYclpp9D oUocpG65AOA52G9psLTcfUIyKfvSIVWy6qlQlOFtlYJ3W28H64hVbqjTEVxyPZsk bSkdQQcfWu60uOslpbiFIFrlXy6jAn1G1dYhQHEsqbLrnRKf64WzDe47ruRqcFWw Un2vZ5VLpa2y6khFyRu6DpieeyW05Xqd4nq1mt5oLiZSh+Wwr+GQ/dCbfH9ml4fU YqZVs8S0UlxCVFKljcVW5UongD9MX39hXUY0akZworuwVJ51mcFXuXEBJSrj+UqH /wB+mCTSMURvsoI7Q5jpIqby6rQmkQ9sdNxxx2xI4UU+SOMfGl0oiOL+mHdqLsQC RaxwS2gYlNz8dSVC1+mFjukMnzOPhhY4lAosOVJDdyqwA5684E2sHjHyVpnUW4Dt Xiy6pIc8pEZhfmlB5/GU3Ceh688Yru1qR/3FqrlHzVmurVN5d3WyLwIzze625tsb Ta5AuSQfiecc2Y1jI+U61U6RR2pLVDklNKkOLR5aVbEbir95fvLKeDc2IJ+MJ09G iFKi09rhs6z7D3KHfjLzVmXVXUFuFUG1kBlU+jjbta8pJZWoBPCk3UgpJV7x3DpY YC/jB0rTqLpHTNQ4ZjoQ802yphCQFhoj9k4TflQJCSAOAUj904K2rlLzhOztSK1O bVIqS6ey4pKXAp0hZd8xhG1CEjajzChNj76U3Ub48aIVmjSazW8qzWvvOk1tpSKM 2DtC2nk3dbTwNhBcJJ6gE/w2xCkqVpBVq1px5GvYQQaG359L/oqg9LnRK4w5T57X lykAg36K9Rhtdyq5RHSGlveXf8IcIFuOgwXfEh4Z6ppbnafAmISqTT1gpcbJPnNK 5Q6njkFP5EKB6XxEsstJqLKI0oIUoEi5HI/3bFVVGkSONUQbHmoLVH0uIKby91+e Tz+vTEYn5cstbzjb20EG6r3OLBT8oRGWC8AtwWAsE8DtfEHzdSGlBaUt9xtA5ub4 W00uE8RpCej5cfzDW0rdSUMMcoSP4vifli1vs4dUk+H3VlqtS4610usPOU+SsEAo Y2o/aXPHuOITftZR+eBbkzTmVNQ+EMgqQ15hF7XFwlKbgHlSlJSOOqhgnZOp8bKM ikhLCZUWI+1EcYU3vRIdcKVPhQPAb3BIJ5sVHg2sZ+GSXF/QBQdSDWwiI83Ee37S 15yNnGk51ojUulT4s+O4AUrYcCx9bdD88SIEKatwecUh0shZdyvKrWY6fSpNHp8J /wAhqXFIYeaZQ2FXCmlbiLk36hQHNwMWJ051nfp2nkepZgl/eLD43okx2kuL2qPC SGuFkD+BIPHQ4smZLSaQtNgOYL68q63++iJ7rY3dbcYWOSj5hiV6ntyob7bzDouF JNrHuCDyCO4PIwsSeIKJRGxVRctTIen+rmeK1VMvSH3qHSmd77qm5C0JLZdWVKKi SfdPS55GPWtf3XE0KiU9utVJa5fkFyPGUpTYeWoOucITcArubX74WFinke5soZaL cXFilwX5FUQ6tjz2+9qa5xptIjsxzTk1R2V9nW4lakO3SpqzgJ3gEosFbgm5I5AN sV41jo7ukmYqHWaM59sjOJ++4bqF7kpkEFTrVx0beClEepXz+EYWFhcd9VBkjbdD qD1vzr2XNq7qJR9b8z0xtqJJny4cAKqFSioQ8tC3dq0xS2SCUtJ947TuCl2HUjAQ zPpvDnumTBcbWlSlpStHuKCkqKVJWk+8haSCClQBB9CDhYWIea0cZ+1Kx0hxd4Cd gAuNrKM1aVIWSoAcEjjHin6dtVCeXnn4kSJFsp+VMdDTLCb9VKPH0HPphYWI+NGJ JQw9VYZrzFE57eYXdUcy0h3J0R2lRlMtQXt6JT6QFT5AJSp0c8Mtt7gkd9yldbAT PSDTKfWKZFqXmR2HKmYUSJGeJ81ILzaibfxG6Ss9QFW523wsLF3JG2Jpa3khtkr8 ggvPQ/gX+TzR9orjuYIufKW7WfslWblSWQy0vcwlP2NsjahQ56nnrfDPQozNUqGW USGa7S35jCiqbRVllNRloAKSUctglIWroOUK64WFiCyZ1GuhVhl4cbJ2jnxNB9Dw 38qI6oZlzzRM91CJGqAbZjqSkfbAlT6vcSbrKUAE8/OwGFhYWJdDyVXxOGwK/9mJ AVUEEwECAD8CGwMGCwkIBwMCBhUIAgkKCwQWAgMBAh4BAheAFiEETmdM/gIIv9lf fDBfEx2+WdLMkJoFAlhfq3cFCQqdKZEACgkQEx2+WdLMkJrgygf/WCZW7cLC7O6t BA4txyscBkLmyfxRPfIPU+eQZLMnVh9M9B7bp60k9REeOFiZ8C1fChj14ESApKMu WE+gHUlo5cq/p5aCR7WNnyv0vVpP9HpjmnEKc6uVUESUPyZGv4/NM+6r/onOvQdj C8kIsph4NbYCnPRFF9Y7EqMYgJGI7YryNyKGM/aNmV5H0jgss2ugw2AVAioM/GRb G1TAsGPy5zhY3+E/uMTntDaFXm3fTk6AIPYeolvqLecazgSqcnMAHa4xeGeD2tya Jx/ypGabwKt/0qhIsmGoSHYRdWIR2OO0qdMaDxSYarMR0NGW3bWXVJ5XsgC+sQkx 7sOW6V/U2YkBPgQTAQIAKAUCUY5eNgIbAwUJA8JnAAYLCQgHAwIGFQgCCQoLBBYC AwECHgECF4AACgkQEx2+WdLMkJok/Af/dRxJpQvaUUiFcsP7pP70IeB6p23xnnK8 n71rad4kX05AhO6DzaJGZVfoAYIIp0DS4kHN3BkhuzDtBAOBfTws6VG+c9cUEH6j Qzwa/jOQBacoK7bNED1wbIpnI7ovjxV1I0ZxH2eyhHtkLZZVxE9SLCkI2ggAtXGC C+P/KeWdR+xlFC6QTr7qGxO5IgHqUr10QgGZB5aDUr8RKi5SIU89nvJQoJJi41Mp tN8hJ3dKfNmXy0ZoCwutJFjHtxufUUFD+lDKQJB/HPkntmYw0thpvAasHsRze+2v xWyDRXiPWqHluuiVlcY/9Vcw4NP05lqLagpeMHyQf9CI1nHP6cSiq7kBDQRRjh6h AQgA5J36bvIV2Fi42XTLYEJk3CId4X5z/b9J7YI+XGtln6/lNL8x2jKUlGTRDfNf TJU+PdYgObZYJ618U6IqXtfGXEcUXUuAa5UePo932T6VEKS/bynwy+YW96dnhzAe QZyQIZ6dnFvQTjpN1vi4eIrsmzAUXQnrT3pksoN7CFqV+GNOqaCrfsZskrE8mx7A xwrIMcq1hwMObc9a9Dvqt8REfyeWlZ6Z6zP5o4zwdnn8vwieaXT8A3ZK2PmU19FP CQYP6lkc+hT0QD6lDtUhRLKBpDv2FGvCgjWwCZTwBpikOKeq0/5ibkhNQ0vb5r23 pl1W6n0s0TB6pqNV/TB/Sc2tAwARAQABiQE8BBgBAgAmAhsMFiEETmdM/gIIv9lf fDBfEx2+WdLMkJoFAlhfrAwFCQqdKZMACgkQEx2+WdLMkJq/nQf/WTf3J49XAhrD 4zK0NeOo8/B/2pN9btV6FG8G3HZHAjz7dOra0HX9u0gOYMJqE61QkiUtT0c5kIlP 7WXAkdqmg9HGZy42qgoZQydUBzIOL/0kl8mONL+yqi6lfJdyqgEaYX8uvh3+ZVOi LDlk59q+E7L2PcG9tJuY7m7yWi0tUDZQF7zr5koq68kAFivZOLJV336TVfVxijXh WXMIMrHdYEbdcCKTHA511SdjTZ7L8GHgAqc/jD+23VT34bgtYkrDrByFM5Y9R7aP 5wBmUMP2JR0nNWTFrzK3sKTbCULvcTzLl+n+vSH9YN63JIr4yULaJZZeJOrEiWpZ 4M+NuzDe4A== =Gjry -----END PGP PUBLIC KEY BLOCK-----","tags":"securite","loc":"https://ehamon.github.io/posts/20150515/my-gpg-public-encryption-key/","title":"\"My GPG Public Encryption Key\""},{"text":"print 'Hello world!'","tags":"python","loc":"https://ehamon.github.io/posts/20130521/affiche-du-python/","title":"Affiche du python"},{"text":"Voici un script ruby pour résoudre de manière élégante les problèmes Sudoku. sudoku = << ENDSUDOKU . . . 1 . . . 6 4 5 . . . 7 . 3 . . 8 . 2 . . . . . . . 4 . . 1 2 5 . . 1 . . . . . . . 2 . . 5 8 3 . . 9 . . . . . . . 4 . 3 . . 9 . 2 . . . 7 7 8 . . . 1 . . . ENDSUDOKU class Sudoku def initialize ( s = nil ) @a = Array . new ( 81 ) # An element for each position on the board @cols = Array . new ( 9 ) { Array . new ( 10 , false ) } # A set for each column @rows = Array . new ( 9 ) { Array . new ( 10 , false ) } # A set for each row @grids = Array . new ( 9 ) { Array . new ( 10 , false ) } # A set for each 3x3 grid s . split . each_with_index { | n , i | self [ i ] = n . to_i unless n == '.' } unless s . nil? end def to_s ( 0 .. 8 ) . map { | i | @a [ i * 9 , 9 ]. map { | n | n || \".\" } . join ( \" \" ) } . join ( \" \\n \" ) + \" \\n \" end def solve ( i = 0 , & block ) if i == 81 yield self # We've reached the end! elsif self [ i ] solve ( i + 1 , & block ) # This square is fixed, so try the next. else for n in ( 1 .. 9 ) do # Try each possible value for this square. if can_set? ( i , n ) self [ i ] = n solve ( i + 1 , & block ) self [ i ] = nil end end end end def [] ( i ) @a [ i ] ; end # Returns true if square i can be set to n without invalidating the sudoku. def can_set? ( i , n ) ! ( col_at ( i ) [ n ] or row_at ( i ) [ n ] or grid_at ( i ) [ n ] ) end def []= ( i , n ) if n . nil? m = @a [ i ] col_at ( i ) [ m ] = false row_at ( i ) [ m ] = false grid_at ( i ) [ m ] = false else col_at ( i ) [ n ] = true row_at ( i ) [ n ] = true grid_at ( i ) [ n ] = true end @a [ i ] = n end private def col_at ( i ) @cols [ i % 9 ] ; end def row_at ( i ) @rows [ i / 9 ] ; end def grid_at ( i ) @grids [ (( i % 9 ) / 3 ) + (( i / 27 ) * 3 ) ] ; end end print Sudoku . new ( sudoku ) . solve { | result | break result . to_s }","tags":"ruby","loc":"https://ehamon.github.io/posts/20130521/resoudre-un-sudoku-en-langage-ruby/","title":"Resoudre un sudoku en langage ruby"}]}